function SelfIntroduce(){
    return(
        <div className="section_part">
       <h3> [안주하지않고 끊임없이 노력하는 지원자 입니다]</h3><br></br>
       <p>저는 프론트엔드 개발자로 지원하는 임재원입니다.</p>
<p>저는 코드 작성 과정에서 제가 설계한 규칙과 로직을 코드에 적용하고 실행했을 때 예상한 대로 원하는 결과가 화면에 보이는 것이 큰 성취감을 얻기 때문입니다. 이러한 경험은 저에게 새로운 도전과 학습의 기회를 제공했습니다. 새로운 아이디어와 규칙으로 코드를 구현하고 실행함으로써 저는 자신감과 창의성을 발전시킬 수 있었습니다. 또한 코드 작성 과정에서 발생하는 문제를 해결하고 수정하는 과정을 통해 문제해결 능력과 분석력도 함께 향상할 수 있었습니다 제가 지원하게 된 이유는 이러한 흥미로운 경험을 보다 규모가 크고 다양한 프로젝트에 적용해보고 싶기 때문입니다. 제가 코드를 통해 구현한 규칙과 아이디어가 실제 제품이나 서비스로 이어지는 과정에 참여하고 이를 통해 많은 사람에게 가치를 제공할 수 있는 기회를 얻고 싶으므로 지원하게 되었습니다</p>

저의 강점은 노력과 끈기, 의사소통 및 갈등 해결 능력 입니다
저는 작년 1년 동안 서울시 교육청 전산직 공무원 시험에 응시했었습니다
그리고 그 시험에서 필기시험 합격이라는 성공 경험을 하였습니다. 시험을 준비하는 동안 저는 꾸준히 노력하고 지치지 않고 목표를 향해 끊임없이 노력했습니다. 어려운 문제나 복잡한 개념에 직면할 때에도 포기하지 않고 극복하는 끈기와 투지를 가지고 있습니다. 이러한 끈기와 노력은 회사에서의 도전적인 프로젝트나 문제에 대해 열정적으로 임하고 어려움을 극복하며 성과를 창출하는데 큰 도움이 될것입니다 또한 목표지향성과 명확한 목표를 설정하고 계획을 통해서 일정을 관리하며 효율적으로 시간을 활용했기 때문에 회사에서 프로젝트의 목표를 설정하고 그에 맞는 전략에 수립할 때 이바지할 수 있을 것입니다 또한 저는 의사소통 및 갈등 해결 능력이 있습니다. 저는 본래 활발하고 친화력 있는 성격입니다 `팀보다 위대한 선수는 없다`라는 말과 같이 팀워크는 몹시 중요한 요소라고 생각합니다. 만약 팀 내에서 의견충돌이 발생했을 때 저는 상호 간의 이해를 도모하고 합리적인 해결책을 찾기 위해 노력합니다. 갈등 상황에서 중재자 역할을 수행하며 팀원들 간의 갈등을 조정하여 협업환경을 유지합니다. 예전에 군에 있을 때 선·후임과 친밀한 관계를 유지하여 또래 상담병 이라는 역할도 수행하였었습니다. 그래서 선·후임들 간의 갈등이 있을 때 각각의 이야기를 들어주고 갈등이 해소될 수 있도록 자리를 만들거나 자연스럽게 화해할 수 있는 상황을 만들도록 했었습니다. 회사에서도 다양한 이해관계자와 조율이 필요한 상황이 많기 때문에 제 갈등 해결 과 조정 능력을 활용하여 원활한 업무 진행에 이바지할 수 있을 것입니다


<p>저는 계속 발전하려고 노력하는 개발자가 되고 싶습니다</p>
<p>프론트엔드 특성상 새로운 기술이 빨리 바뀌는 것에 적응해야 한다고 생각합니다 새로운 기술에 두려워하지 않고 지속적인 언어 공부와 기술 습득을 통해서 효율적이고 지속이 가능한 솔루션을 제공하는 개발자로 성장하고 싶습니다 또한 사용자가 사용할 때 어떤 점이 불편한지 그 불편한 점이 있다면 어떻게 해결할 것인지를 생각하는 개발자가 되고 싶습니다 저는 퇴근 이후 회사와 관련된 업무를 잘 적응할 수 있도록 업무에 관련된 추가적인 공부를 할 것입니다</p>

<p>저는 개발자가 되기 위해서 대학에서 컴퓨터공학을 전공하면서 프로그래밍 언어와 알고리즘에 대한 기본 지식을 학습했습니다. 또한 졸업 이후 전산직 공무원을 준비하는 과정에서 정보처리산업기사를 취득하였고, 전산직 공무원 공부를 통해 더 깊은 CS 지식을 공부할 수 있었습니다 이후 국비 지원 프로그램을 이용해 프로그래밍에 대해서 다시 배웠고, 팀 프로젝트를 수행하면서 실제 개발 경험을 쌓고 새로운 기술과 도구를 습득하는데 집중했습니다. 프로젝트에서 '마이페이지', '소모임 게시판', '다크모드', '광고', '쪽지함'을 맡았습니다. 프로젝트를 구현할 때 지속적으로 사용자의 편의성에 대해서 생각했습니다. 예를 들면, 소모임은 그룹장과 사용자가 접근할 때 웹보다는 모바일로 연락할 수 있도록 링크를 QR 코드로 변환하는 API를 사용하여 게시판 작성 시 오픈 카카오톡 채팅방 링크를 기입하도록 했습니다.</p>
팀 프로젝트를 경험해보고 나니 사용자의 입장에서 생각하는 것과 좀 더 효율적으로 코딩하는 방법의 중요성을 알게 됐습니다. 입사 후에는 새로운 기술과 도구에 대한 학습을 지속적으로 진행하고, 이를 업무에 적용하여 효율성과 생산성을 높이는데 기여하겠습니다.



        </div>
    )
}

export default SelfIntroduce;